wiki/git-wiki.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://pengpengxp.github.io/css/wiki.css" />
#+TITLE: Git wiki

* git reset
** git reset base
   reset其实就是在move HEAD指针。顺便会改变几个空间中的内容。
   #+BEGIN_SRC sh
      # head = HEAD~, index = HEAD, working_directory = HEAD
      git reset --soft HEAD~

      # head = HEAD~, index = HEAD~, working_directory = HEAD ,default
      # methods
      git reset --mixed HEAD~

      # head = HEAD~, index = HEAD~, working_directory = HEAD~ , this is
      # dangerous because some commit may lost!
      git reset --hard HEAD~
   #+END_SRC

   =git add= 到index中的内容是不可回退的。git add后，使用 =git reset
   HEAD= 可以回退到add之前的状态。

   =reset --hard= 后，其实那些commit是还在的。这些没有被任何branch引
   用的commit叫 =dangling commit= 。这些东西git会定期清理它。如果想手
   动清理，需要先把reflog清理掉（我理解reflog还是在“引用”它。）然后
   手动用 =git gc= 来清理就可以了。
   #+BEGIN_SRC sh
       git reflog expire --expire-unreachable=now --all
       git gc --prune=now
   #+END_SRC
** git reset with path or files
   #+BEGIN_EXAMPLE
      +----------------------------------------------------------------------+
      |                                                    +---------------+ |
      |                                                    |     HEAD      | |
      |                                                    +------+--------+ |
      |                                                           |          |
      |                                                    +------+--------+ |
      |                                                    |    master     | |
      |                                                    +------+--------+ |
      |                                                           |          |
      +---------------+          +---------------+         +------v--------+ |
      |  commit_id:x  |          |  commit_id:y  |         |  commit_id:z  | |
      |               |          |               |         |               | |
      |   file.txt    |<---------+   file.txt    |<--------+   file.txt    | |
      |     v1        |          |     v2        |         |     v3        | |
      |               |          |               |         |               | |
      +---------------+          +---------------+         +---------------+ |
      |                                                                      |
      |                          Git repository                              |
      +----------------------------------------------------------------------+

      +---------------+          +---------------+         +-----------------+
      |    HEAD       |          |    Index      |         |Working Directory|
      +---------------+          +---------------+         +-----------------+
      |  commit_id:z  |          |               |         |                 |
      |               |          |               |         |                 |
      |   file.txt    |          |   file.txt    |         |   file.txt      |
      |     v3        |          |     v1        |         |     v3          |
      |               |          |               |         |                 |
      +---------------+          +---------------+         +-----------------+

      git reset commit_id:x file.txt
   #+END_EXAMPLE

   =git reset= 如果针对file或path进行操作。只是简单地是把对应
   commit_id中的的file放到Index（暂存区）中。

   如果对应的commit_id刚好是HEAD，则 =git reset HEAD file= 刚好和
   =git add file= 在上图是对称动作。
   #+BEGIN_EXAMPLE
      +----------+                           +----------+                   +-----------------+
      |  HEAD    |                           |  Index   |                   |Working Directory|
      +----------+                           +----------+                   +-----------------+
      |          |                           |          |                   |                 |
      |          |  git reset HEAD file.txt  |          |  git add file.txt |                 |
      | file.txt |-------------------------->| file.txt |<------------------|   file.txt      |
      |          |                           |          |                   |                 |
      |          |                           |          |                   |                 |
      +----------+                           +----------+                   +-----------------+

   #+END_EXAMPLE

