wiki/git-wiki.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-25 一 17:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git wiki</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pengpengxp" />
<link rel="stylesheet" type="text/css" href="https://pengpengxp.github.io/css/wiki.css" />
</head>
<body>
<div id="content">
<h1 class="title">Git wiki</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf21f81c">1. git reset</a>
<ul>
<li><a href="#org0bc9bfa">1.1. git reset base</a></li>
<li><a href="#orgbfe7e0d">1.2. git reset with path or files</a></li>
</ul>
</li>
<li><a href="#orgdbea065">2. git checkout with path or file</a></li>
<li><a href="#org0da6181">3. git blame</a></li>
<li><a href="#org271adea">4. git merge</a>
<ul>
<li><a href="#org74909ff">4.1. git 解决merge冲突的经验和技巧</a></li>
<li><a href="#orgc1d8e1b">4.2. git merge conflict 以某一分支为准直接应用</a></li>
<li><a href="#org6b6e10c">4.3. git merge-base</a></li>
</ul>
</li>
<li><a href="#org2ccaa84">5. git merge rebase and cherry-pick</a></li>
<li><a href="#orga972583">6. git stash</a></li>
<li><a href="#git_config">7. git config</a>
<ul>
<li><a href="#org4fd3e83">7.1. git config base</a></li>
<li><a href="#org198bc30">7.2. git config的 <code>--global</code> 选项</a></li>
</ul>
</li>
<li><a href="#orgc630349">8. git reflog和git log</a></li>
<li><a href="#org6551dd9">9. git revert</a></li>
<li><a href="#git-push">10. git push</a>
<ul>
<li><a href="#org88a1087">10.1. 常规用法</a></li>
<li><a href="#org9eaf89c">10.2. 具体解释</a></li>
<li><a href="#git-push-default">10.3. push.default</a></li>
</ul>
</li>
<li><a href="#git-track">11. git track							  :git track:</a></li>
<li><a href="#git-fetch">12. git fetch</a></li>
<li><a href="#git-pull">13. git pull</a></li>
<li><a href="#orga6a1118">14. git remote</a>
<ul>
<li><a href="#orgae7d084">14.1. git remote base</a></li>
<li><a href="#orgdbcba7b">14.2. git remote add &amp; git fetch</a></li>
</ul>
</li>
<li><a href="#org74c2adc">15. git diff</a></li>
<li><a href="#org9f73b08">16. git clean</a></li>
<li><a href="#org02752f9">17. git 工具</a>
<ul>
<li><a href="#orgd68fcf3">17.1. tig</a>
<ul>
<li><a href="#org9804004">17.1.1. 命令行下的git interface</a></li>
<li><a href="#orgd622a55">17.1.2. status view(s)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#git-example">18. 一个实际的例子</a>
<ul>
<li><a href="#org1dbeeab">18.1. 传是去以后还有一些文件夹没有实际上传</a></li>
<li><a href="#org91d8681">18.2. 配置ssh，不需要每次输入密码</a></li>
</ul>
</li>
<li><a href="#orgb693221">19. git submodule</a></li>
<li><a href="#org6cbed87">20. MISC</a>
<ul>
<li><a href="#org8cef51f">20.1. 找一个库中someone修改过的文件</a></li>
<li><a href="#orgd76c2d3">20.2. Doc</a></li>
<li><a href="#org4e59e51">20.3. git clone只能克隆master分支，需要所有分支的时候不知道怎么办？</a></li>
<li><a href="#orgaca066c">20.4. 远程怎么删除分支</a></li>
<li><a href="#org6768b5d">20.5. 在emacs使用magit与远程进行交互</a></li>
</ul>
</li>
<li><a href="#orgef56a7e">21. <span class="todo TODO">TODO</span> 自已配置一个git server自已使用</a></li>
<li><a href="#orgaae5824">22. 定义自己本地的 <code>.gitignore</code></a></li>
<li><a href="#orgfb688ba">23. magit</a></li>
<li><a href="#orgebbeffb">24. 使用gitlab直接在command line中gitlab发merge request</a></li>
<li><a href="#orgdeb1bcb">25. git显示一个文件的所有历史修改记录</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf21f81c" class="outline-2">
<h2 id="orgf21f81c"><span class="section-number-2">1</span> git reset</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0bc9bfa" class="outline-3">
<h3 id="org0bc9bfa"><span class="section-number-3">1.1</span> git reset base</h3>
<div class="outline-text-3" id="text-1-1">
<p>
reset其实就是在move HEAD指针。顺便会改变几个空间中的内容。
</p>
<div class="org-src-container">
<pre class="src src-sh">      <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">head = HEAD~, index = HEAD, working_directory = HEAD</span>
      git reset --soft HEAD~

      <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">head = HEAD~, index = HEAD~, working_directory = HEAD ,default</span>
      <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">methods</span>
      git reset --mixed HEAD~

      <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">head = HEAD~, index = HEAD~, working_directory = HEAD~ , this is</span>
      <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">dangerous because some commit may lost!</span>
      git reset --hard HEAD~
</pre>
</div>

<p>
<code>git add</code> 到index中的内容是不可回退的。git add后，使用 <code>git reset
   HEAD</code> 可以回退到add之前的状态。
</p>

<p>
<code>reset --hard</code> 后，其实那些commit是还在的。这些没有被任何branch引
用的commit叫 <code>dangling commit</code> 。这些东西git会定期清理它。如果想手
动清理，需要先把reflog清理掉（我理解reflog还是在“引用”它。）然后
手动用 <code>git gc</code> 来清理就可以了。
</p>
<div class="org-src-container">
<pre class="src src-sh">       git reflog expire --expire-unreachable=now --all
       git gc --prune=now
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbfe7e0d" class="outline-3">
<h3 id="orgbfe7e0d"><span class="section-number-3">1.2</span> git reset with path or files</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
      +----------------------------------------------------------------------+
      |                                                    +---------------+ |
      |                                                    |     HEAD      | |
      |                                                    +------+--------+ |
      |                                                           |          |
      |                                                    +------+--------+ |
      |                                                    |    master     | |
      |                                                    +------+--------+ |
      |                                                           |          |
      +---------------+          +---------------+         +------v--------+ |
      |  commit_id:x  |          |  commit_id:y  |         |  commit_id:z  | |
      |               |          |               |         |               | |
      |   file.txt    |&lt;---------+   file.txt    |&lt;--------+   file.txt    | |
      |     v1        |          |     v2        |         |     v3        | |
      |               |          |               |         |               | |
      +---------------+          +---------------+         +---------------+ |
      |                                                                      |
      |                          Git repository                              |
      +----------------------------------------------------------------------+

      +---------------+          +---------------+         +-----------------+
      |    HEAD       |          |    Index      |         |Working Directory|
      +---------------+          +---------------+         +-----------------+
      |  commit_id:z  |          |               |         |                 |
      |               |          |               |         |                 |
      |   file.txt    |          |   file.txt    |         |   file.txt      |
      |     v3        |          |     v1        |         |     v3          |
      |               |          |               |         |                 |
      +---------------+          +---------------+         +-----------------+

      git reset commit_id:x file.txt
</pre>

<p>
<code>git reset</code> 如果针对file或path进行操作。只是简单地是把对应
commit<sub>id中的的file放到Index</sub>（暂存区）中。
</p>

<p>
如果对应的commit<sub>id刚好是HEAD</sub>，则 <code>git reset HEAD file</code> 刚好和
<code>git add file</code> 在上图是对称动作。
</p>
<pre class="example">
      +----------+                           +----------+                   +-----------------+
      |  HEAD    |                           |  Index   |                   |Working Directory|
      +----------+                           +----------+                   +-----------------+
      |          |                           |          |                   |                 |
      |          |  git reset HEAD file.txt  |          |  git add file.txt |                 |
      | file.txt |--------------------------&gt;| file.txt |&lt;------------------|   file.txt      |
      |          |                           |          |                   |                 |
      |          |                           |          |                   |                 |
      +----------+                           +----------+                   +-----------------+

</pre>
</div>
</div>
</div>
