wiki/git-wiki.org
* git checkout with path or file
  =git checkout commid_id file= 和 =git reset commid_id file= 的区别
  是把对应commit_id中的file同时放到了Index和Working Directory。
  #+BEGIN_EXAMPLE
     +----------------------------------------------------------------------+
     |                                                    +---------------+ |
     |                                                    |     HEAD      | |
     |                                                    +------+--------+ |
     |                                                           |          |
     |                                                    +------+--------+ |
     |                                                    |    master     | |
     |                                                    +------+--------+ |
     |                                                           |          |
     +---------------+          +---------------+         +------v--------+ |
     |  commit_id:x  |          |  commit_id:y  |         |  commit_id:z  | |
     |               |          |               |         |               | |
     |   file.txt    |<---------+   file.txt    |<--------+   file.txt    | |
     |     v1        |          |     v2        |         |     v3        | |
     |               |          |               |         |               | |
     +---------------+          +---------------+         +---------------+ |
     |                                                                      |
     |                          Git repository                              |
     +----------------------------------------------------------------------+

     +---------------+          +---------------+         +-----------------+
     |    HEAD       |          |    Index      |         |Working Directory|
     +---------------+          +---------------+         +-----------------+
     |  commit_id:z  |          |               |         |                 |
     |               |          |               |         |                 |
     |   file.txt    |          |   file.txt    |         |   file.txt      |
     |     v3        |          |     v1        |         |     v1          |
     |               |          |               |         |                 |
     +---------------+          +---------------+         +-----------------+

     git checkout commit_id:x file.txt
  #+END_EXAMPLE

* git blame
  =git blame <filename>= 可以查看一个文件被谁修改过，这个在debug的时候
  很有用

* git merge
** git 解决merge冲突的经验和技巧
   [[https://www.zhihu.com/question/21215715][对于解决 Git 的 Merge Conflict 你有哪些经验和技巧？]]
   #+BEGIN_EXAMPLE
     我的经验是使用rebase。

     具体操作
     1. git add <FILE>
     2. git commit ...
     3. git pull --rebase （将你的版本加在最后的节点上） 如果有冲突，会
        提示你。冲突分为两种，一种是在不同地方的冲突，通常情况下，git是
        可以自己合并的。另外一种是因为可能是同一个文件的编辑，git没法自
        动合并，需要二选一，这时候打开冲突的文件，手动编辑文件到可用的版
        本。然后。
     4. git rebase --continue
     5. 重复3，4直到所有的都solve
     6. git push
   #+END_EXAMPLE

** git merge conflict 以某一分支为准直接应用
   By default, when Git sees a conflict between two branches being
   merged, it will add merge conflict markers into your code and mark
   the file as conflicted and let you resolve it. If you would prefer
   for Git to simply choose a specific side and ignore the other side
   instead of letting you manually merge the conflict, you can pass
   the merge command either a -Xours or -Xtheirs.

   如果出现了confict，如果确信是可以保存某一分支的内容。可以使用这个选
   项。
   #+BEGIN_SRC sh
      git checkout -b A
      git checkout master
      # 合并后以当前master为准
      git merge -Xours A
      # 合并后以A为准
      git merge -Xtheris A
   #+END_SRC
** git merge-base
   可以找到两个commit的共同的祖先。这个在想找到分支的交叉点的时候很有
   用。
   #+BEGIN_SRC sh
      git merge-base 7d6930f4c77bc7cd5e018ce046a26726ec448db3 000351e7b82e3211dd8fa5f4d0c09d647b66f450
   #+END_SRC

* git merge rebase and cherry-pick
  merge在history上是直接汇总两个分支。

  rebase是使用把两个分支中的不同内容整成一个patch，然后应用到被rebase
  的分支。它会修改git的历史。做了rebase操作，git log不会出现 =Merged
  from= 这样的提交。history是线性的。

  cherry-pick: =A cherry-pick in Git is like a rebase for a single
  commit.= cherry-pick可以把某一个特定的commit rebase到对应分支。

* git stash
  可以暂存当前工作区的内容，以待后续使用。它是以栈的形式存在的。使用
  直接就 =git stash= 就可以了，这样当前缓冲区就是clean的了。需要恢复
  的时候，使用 =git stash apply XXXX= 就可以了。

  常用命令：
  #+BEGIN_SRC sh
     git stash
     git stash list
     git stash apply
     git stash clear
     git stash pop
     git stash drop
  #+END_SRC

  最新建的stash的index是0哦。最旧的数字最大。

* git config
  :PROPERTIES:
  :CUSTOM_ID: git_config
  :END:
** git config base
   使用git时最先需要设置的是就是用户名和邮箱：
   #+BEGIN_SRC sh
      git config --global user.name 'xxxxx'
      git config --global user.email 'xxxx@gmail.com'
   #+END_SRC

   设置commit的模版，以后每次commit都会自动加入这个模版。
   #+BEGIN_SRC sh
      git config --global commit.template ~/.gitmessage.txt
   #+END_SRC

   配置默认使用emacs编辑器，这里 =emacsclient= 不能加 =--no-wait= 选项。
   需要让命令行等待emacsclient：
   #+BEGIN_SRC sh
      git config --global core.editor 'emacsclient'
   #+END_SRC

** git config的 =--global= 选项
   可以看到上一小节中我们在配置时都带了 =--global= 选项。从名字中可以
   看出这是一个全局设置的意思。它默认修改的是 =~/.gitconfig= 文件。比
   如我当前的这个文件长这样：
   #+BEGIN_SRC conf-space
     [diff]
             tool = bc3
     [difftool]
             prompt = false
     [merge]
             tool = bc3
     [mergetool]
             prompt = true
             keepBackup = false
     [filter "lfs"]
             clean = git-lfs clean %f
             smudge = git-lfs smudge %f
             required = true
     [user]
             name = PengXie
             email = xxx@gmail.com
     [core]
             quotepath = false
             editor = emacsclient
     [commit]
             template = /Users/pengpengxp/.gitmessage.txt
     [http]
             proxy = socks5://172.16.25.48:1089
     [https]
             proxy = socks5://172.16.25.48:1089
     [push]
             default = simple

   #+END_SRC

   如果不加这个选项，默认是就是配置当前仓库（需在在一个仓库内执行，不
   然会报错。）。此时它修改的是当前目录下 =.git/config= 文件。只对本仓
   库有效。

