wiki/git-wiki.html

<div id="outline-container-orgdbea065" class="outline-2">
<h2 id="orgdbea065"><span class="section-number-2">2</span> git checkout with path or file</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>git checkout commid_id file</code> 和 <code>git reset commid_id file</code> 的区别
是把对应commit<sub>id中的file同时放到了Index和Working</sub> Directory。
</p>
<pre class="example">
     +----------------------------------------------------------------------+
     |                                                    +---------------+ |
     |                                                    |     HEAD      | |
     |                                                    +------+--------+ |
     |                                                           |          |
     |                                                    +------+--------+ |
     |                                                    |    master     | |
     |                                                    +------+--------+ |
     |                                                           |          |
     +---------------+          +---------------+         +------v--------+ |
     |  commit_id:x  |          |  commit_id:y  |         |  commit_id:z  | |
     |               |          |               |         |               | |
     |   file.txt    |&lt;---------+   file.txt    |&lt;--------+   file.txt    | |
     |     v1        |          |     v2        |         |     v3        | |
     |               |          |               |         |               | |
     +---------------+          +---------------+         +---------------+ |
     |                                                                      |
     |                          Git repository                              |
     +----------------------------------------------------------------------+

     +---------------+          +---------------+         +-----------------+
     |    HEAD       |          |    Index      |         |Working Directory|
     +---------------+          +---------------+         +-----------------+
     |  commit_id:z  |          |               |         |                 |
     |               |          |               |         |                 |
     |   file.txt    |          |   file.txt    |         |   file.txt      |
     |     v3        |          |     v1        |         |     v1          |
     |               |          |               |         |                 |
     +---------------+          +---------------+         +-----------------+

     git checkout commit_id:x file.txt
</pre>
</div>
</div>

<div id="outline-container-org0da6181" class="outline-2">
<h2 id="org0da6181"><span class="section-number-2">3</span> git blame</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>git blame &lt;filename&gt;</code> 可以查看一个文件被谁修改过，这个在debug的时候
很有用
</p>
</div>
</div>

<div id="outline-container-org271adea" class="outline-2">
<h2 id="org271adea"><span class="section-number-2">4</span> git merge</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org74909ff" class="outline-3">
<h3 id="org74909ff"><span class="section-number-3">4.1</span> git 解决merge冲突的经验和技巧</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="https://www.zhihu.com/question/21215715">对于解决 Git 的 Merge Conflict 你有哪些经验和技巧？</a>
</p>
<pre class="example">
     我的经验是使用rebase。

     具体操作
     1. git add &lt;FILE&gt;
     2. git commit ...
     3. git pull --rebase （将你的版本加在最后的节点上） 如果有冲突，会
        提示你。冲突分为两种，一种是在不同地方的冲突，通常情况下，git是
        可以自己合并的。另外一种是因为可能是同一个文件的编辑，git没法自
        动合并，需要二选一，这时候打开冲突的文件，手动编辑文件到可用的版
        本。然后。
     4. git rebase --continue
     5. 重复3，4直到所有的都solve
     6. git push
</pre>
</div>
</div>

<div id="outline-container-orgc1d8e1b" class="outline-3">
<h3 id="orgc1d8e1b"><span class="section-number-3">4.2</span> git merge conflict 以某一分支为准直接应用</h3>
<div class="outline-text-3" id="text-4-2">
<p>
By default, when Git sees a conflict between two branches being
merged, it will add merge conflict markers into your code and mark
the file as conflicted and let you resolve it. If you would prefer
for Git to simply choose a specific side and ignore the other side
instead of letting you manually merge the conflict, you can pass
the merge command either a -Xours or -Xtheirs.
</p>

<p>
如果出现了confict，如果确信是可以保存某一分支的内容。可以使用这个选
项。
</p>
<div class="org-src-container">
<pre class="src src-sh">      git checkout -b A
      git checkout master
      <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">&#21512;&#24182;&#21518;&#20197;&#24403;&#21069;master&#20026;&#20934;</span>
      git merge -Xours A
      <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">&#21512;&#24182;&#21518;&#20197;A&#20026;&#20934;</span>
      git merge -Xtheris A
</pre>
</div>
</div>
</div>
<div id="outline-container-org6b6e10c" class="outline-3">
<h3 id="org6b6e10c"><span class="section-number-3">4.3</span> git merge-base</h3>
<div class="outline-text-3" id="text-4-3">
<p>
可以找到两个commit的共同的祖先。这个在想找到分支的交叉点的时候很有
用。
</p>
<div class="org-src-container">
<pre class="src src-sh">      git merge-base 7d6930f4c77bc7cd5e018ce046a26726ec448db3 000351e7b82e3211dd8fa5f4d0c09d647b66f450
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2ccaa84" class="outline-2">
<h2 id="org2ccaa84"><span class="section-number-2">5</span> git merge rebase and cherry-pick</h2>
<div class="outline-text-2" id="text-5">
<p>
merge在history上是直接汇总两个分支。
</p>

<p>
rebase是使用把两个分支中的不同内容整成一个patch，然后应用到被rebase
的分支。它会修改git的历史。做了rebase操作，git log不会出现 <code>Merged
  from</code> 这样的提交。history是线性的。
</p>

<p>
cherry-pick: <code>A cherry-pick in Git is like a rebase for a single
  commit.</code> cherry-pick可以把某一个特定的commit rebase到对应分支。
</p>
</div>
</div>

<div id="outline-container-orga972583" class="outline-2">
<h2 id="orga972583"><span class="section-number-2">6</span> git stash</h2>
<div class="outline-text-2" id="text-6">
<p>
可以暂存当前工作区的内容，以待后续使用。它是以栈的形式存在的。使用
直接就 <code>git stash</code> 就可以了，这样当前缓冲区就是clean的了。需要恢复
的时候，使用 <code>git stash apply XXXX</code> 就可以了。
</p>

<p>
常用命令：
</p>
<div class="org-src-container">
<pre class="src src-sh">     git stash
     git stash list
     git stash apply
     git stash clear
     git stash pop
     git stash drop
</pre>
</div>

<p>
最新建的stash的index是0哦。最旧的数字最大。
</p>
</div>
</div>

<div id="outline-container-org232c208" class="outline-2">
<h2 id="git_config"><a id="org232c208"></a><span class="section-number-2">7</span> git config</h2>
<div class="outline-text-2" id="text-git_config">
</div>
<div id="outline-container-org4fd3e83" class="outline-3">
<h3 id="org4fd3e83"><span class="section-number-3">7.1</span> git config base</h3>
<div class="outline-text-3" id="text-7-1">
<p>
使用git时最先需要设置的是就是用户名和邮箱：
</p>
<div class="org-src-container">
<pre class="src src-sh">      git config --global user.name <span style="color: #ffa500;">'xxxxx'</span>
      git config --global user.email <span style="color: #ffa500;">'xxxx@gmail.com'</span>
</pre>
</div>

<p>
设置commit的模版，以后每次commit都会自动加入这个模版。
</p>
<div class="org-src-container">
<pre class="src src-sh">      git config --global commit.template ~/.gitmessage.txt
</pre>
</div>

<p>
配置默认使用emacs编辑器，这里 <code>emacsclient</code> 不能加 <code>--no-wait</code> 选项。
需要让命令行等待emacsclient：
</p>
<div class="org-src-container">
<pre class="src src-sh">      git config --global core.editor <span style="color: #ffa500;">'emacsclient'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org198bc30" class="outline-3">
<h3 id="org198bc30"><span class="section-number-3">7.2</span> git config的 <code>--global</code> 选项</h3>
<div class="outline-text-3" id="text-7-2">
<p>
可以看到上一小节中我们在配置时都带了 <code>--global</code> 选项。从名字中可以
看出这是一个全局设置的意思。它默认修改的是 <code>~/.gitconfig</code> 文件。比
如我当前的这个文件长这样：
</p>
<div class="org-src-container">
<pre class="src src-conf-space">     [<span style="color: #00ff00;">diff</span>]
             <span style="color: #8fbc8f;">tool</span> = bc3
     [<span style="color: #00ff00;">difftool</span>]
             <span style="color: #8fbc8f;">prompt</span> = false
     [<span style="color: #00ff00;">merge</span>]
             <span style="color: #8fbc8f;">tool</span> = bc3
     [<span style="color: #00ff00;">mergetool</span>]
             <span style="color: #8fbc8f;">prompt</span> = true
             <span style="color: #8fbc8f;">keepBackup</span> = false
     <span style="color: #8fbc8f;">[filter</span> <span style="color: #ffa500;">"lfs"</span>]
             <span style="color: #8fbc8f;">clean</span> = git-lfs clean %f
             <span style="color: #8fbc8f;">smudge</span> = git-lfs smudge %f
             <span style="color: #8fbc8f;">required</span> = true
     [<span style="color: #00ff00;">user</span>]
             <span style="color: #8fbc8f;">name</span> = PengXie
             <span style="color: #8fbc8f;">email</span> = xxx@gmail.com
     [<span style="color: #00ff00;">core</span>]
             <span style="color: #8fbc8f;">quotepath</span> = false
             <span style="color: #8fbc8f;">editor</span> = emacsclient
     [<span style="color: #00ff00;">commit</span>]
             <span style="color: #8fbc8f;">template</span> = /Users/pengpengxp/.gitmessage.txt
     [<span style="color: #00ff00;">http</span>]
             <span style="color: #8fbc8f;">proxy</span> = socks5://172.16.25.48:1089
     [<span style="color: #00ff00;">https</span>]
             <span style="color: #8fbc8f;">proxy</span> = socks5://172.16.25.48:1089
     [<span style="color: #00ff00;">push</span>]
             <span style="color: #8fbc8f;">default</span> = simple

</pre>
</div>

<p>
如果不加这个选项，默认是就是配置当前仓库（需在在一个仓库内执行，不
然会报错。）。此时它修改的是当前目录下 <code>.git/config</code> 文件。只对本仓
库有效。
</p>
</div>
</div>
</div>
