wiki/git-wiki.org
* git reflog和git log
  =git reflog= 是暂存本地自己的commit、pull、checkout等操作的，感觉就
  像是操作日志。记录了每个commit号。它是和commit等这样如果你不小心执
  行了删除分支等操作。但是你也许还是可以找回来的。它默认是暂存90天的。
  可以配置。也就是说git里只要commit了。信息应该是很难丢失的。可以使用
  =git log -g= 来更详细地显示reflog。

  =git log= 是从当前HEAD指向的commit一级一级回退到祖先的日志。

  下面是教程上讲的 =git reflog= ：
  #+BEGIN_EXAMPLE
     这样就丢弃了最新的两个 commit ── 包含这两个 commit 的分支不存在了。
     现在要做的是找出最新的那个 commit 的 SHA，然后添加一个指它它的分支。关
     键在于找出最新的 commit 的 SHA ── 你不大可能记住了这个 SHA，是吧？

     通常最快捷的办法是使用 git reflog 工具。当你 (在一个仓库下) 工作时，
     Git 会在你每次修改了 HEAD 时悄悄地将改动记录下来。当你提交或修改分支时，
     reflog 就会更新。git update-ref 命令也可以更新 reflog，这是在本章前面
     的 "Git References" 部分我们使用该命令而不是手工将 SHA 值写入 ref 文件
     的理由。任何时间运行 git reflog 命令可以查看当前的状态：
  #+END_EXAMPLE

* git revert
  git revert commit_id会把对应的commit的修改找出来干掉，如果有冲突就
  提示unmerge。它不会修改提交历史，而是会产生一次新的commit。

  我试了一下，如果要去掉的这次commit_id完全工作在一个和后面提交都不相
  关的文件时，可以直接revert。它产生了新的提交，新提交中去掉了
  commit_id对应的内容。原来的那些提交都在的。

* git push
  :PROPERTIES:
  :CUSTOM_ID: git-push
  :END:
** 常规用法
   #+BEGIN_EXAMPLE
     git push origin local-branch-name:server-branch-name
   #+END_EXAMPLE
   把local的branch推送到origin标记的remote上的名字为server-branch-name的
   branch，如果没有，则新建。
   #+BEGIN_EXAMPLE
     git push origin --all
   #+END_EXAMPLE
   把本地所有分支推送到remote上去。名字就和本地是一样的。

** 具体解释
   --------------------------------------------------------------------------------
   git push origin serverfix:serverfix

   it says,"Take my /serverfix/ and make it the remote's /serverfix/." You
   can use thsi format to push a local branch into a remote branch that
   is named differently. If you didn't want it to be called /serverfix/ on
   the remote, you could instead run git push origin
   /serverfix/:awesomebranch to push your local /serverfix/ branch to the
   awesomebranch branch on the remote project; If you didn't want it to
   be called /serverfix/ on the remote, you could instead run $git push
   origin serverfix:awesomebranch$ to push your local /serverfix/ branch to
   the awesomebranch branch on the remote project.
   --------------------------------------------------------------------------------

   *我的理解*
   --------------------------------------------------------------------------------
   git push origin localserverfix:remoteserverfix

   localserverfix是本地branch的名字，remoteserverfix是remote端branch的名
   字。
   --------------------------------------------------------------------------------
** push.default
   :PROPERTIES:
   :CUSTOM_ID: git-push-default
   :END:
   设置这个选项，可以不用每次都显示的指定需要push的分支，设置对了，以后就
   直接git push就行了。。manual上面是这么写的：
   #+BEGIN_EXAMPLE
     push.default
         Defines the action git push should take if no refspec is explicitly given. Different values are well-suited for specific
         workflows; for instance, in a purely central workflow (i.e. the fetch source is equal to the push destination), upstream is
         probably what you want. Possible values are:

         ·   nothing - do not push anything (error out) unless a refspec is explicitly given. This is primarily meant for people who
             want to avoid mistakes by always being explicit.

         ·   current - push the current branch to update a branch with the same name on the receiving end. Works in both central and
             non-central workflows.

         ·   upstream - push the current branch back to the branch whose changes are usually integrated into the current branch (which
             is called @{upstream}). This mode only makes sense if you are pushing to the same repository you would normally pull from
             (i.e. central workflow).

         ·   simple - in centralized workflow, work like upstream with an added safety to refuse to push if the upstream branch’s name
             is different from the local one.

             When pushing to a remote that is different from the remote you normally pull from, work as current. This is the safest
             option and is suited for beginners.

             This mode will become the default in Git 2.0.

         ·   matching - push all branches having the same name on both ends. This makes the repository you are pushing to remember the
             set of branches that will be pushed out (e.g. if you always push maint and master there and no other branches, the
             repository you push to will have these two branches, and your local maint and master will be pushed there).

             To use this mode effectively, you have to make sure all the branches you would push out are ready to be pushed out before
             running git push, as the whole point of this mode is to allow you to push all of the branches in one go. If you usually
             finish work on only one branch and push out the result, while other branches are unfinished, this mode is not for you. Also
             this mode is not suitable for pushing into a shared central repository, as other people may add new branches there, or
             update the tip of existing branches outside your control.

             This is currently the default, but Git 2.0 will change the default to simple.

   #+END_EXAMPLE
   我暂时使用设置成了 =current= 选项。每次都push我的当前分支。现在推
   荐使用 =simple= 。
   #+BEGIN_EXAMPLE
     git config --global push.default "simple"
   #+END_EXAMPLE

* git track							  :git track:
  :PROPERTIES:
  :CUSTOM_ID: git-track
  :END:
  *原文*
  --------------------------------------------------------------------------------
  When you clone a repository, it generally automatically creates a
  master branch that tracks origin/master.

  这就是为什么我自己建立一个local的repository，再使用push传到网上之后，
  没有建立联系的原因。我没有track。
  --------------------------------------------------------------------------------

  新建一个branch，然后track remote端的branch：
  #+BEGIN_EXAMPLE
    git checkout -b new-branch --track origin/master
  #+END_EXAMPLE
  我是新建了一个test branch track了origin/master以后。将master branch改
  名为master_bak，然后将test改名为master这样曲线救国的。

  *Question*
  --------------------------------------------------------------------------------
  1) how to make the current branch(master) to track the remote branch
     rather than making a new local branch?
  --------------------------------------------------------------------------------

* git fetch
  :PROPERTIES:
  :CUSTOM_ID: git-fetch
  :END:
  我理解如下：
  1. git fetch就是和远端做了一次“数据库同步”。
  2. 它更新了本地git的“数据库”。
  3. 它完全不会修改本地任何文件。

  举一个简单的例子：A和B都clone了仓库后，B先push了一次代码。那么A怎么
  能知道B的修改呢？git可能会提醒你需要使用 [[#git-pull][git pull]] 。但如果你不想把你
  当前工作的目录弄的乱七八糟的。我真心 *不建议* 使用 =git pull= 。

  这时候A使用 =git fetch= 。它就能知道B的修改啦。而且我保证，A的工作目
  录没有任何修改。

  git fetch可以选择fetch不同的remote：
  #+BEGIN_SRC sh
    git fetch origin
  #+END_SRC

* git pull
  :PROPERTIES:
  :CUSTOM_ID: git-pull
  :END:

  =git pull= 全等于 =git fetch; git merge FETCH_END=

  progit上这么写的：
  #+BEGIN_EXAMPLE
    Running git pull generally fetches data from the server you originally
    cloned from and automatically tries to merge it into the code you’re
    currently working on.
  #+END_EXAMPLE

* git remote
