wiki/git-wiki.org
** git remote base
   git可以是一个本地库，但是它更多地，应该是和远端做交互，以进行多人协
   作。

   =git remote= 命令就是设置远端库的地址的。常用的命令：
   #+BEGIN_SRC sh
     # 查询所有远端
     git remote -v
     # 添加
     git remote add origin <url>
     # 修改
     git remote set-url origin <url>
     # 其它
     git remote --help
   #+END_SRC

   其实可以看到，这些 =origin= 都只是一个 =url= 的别名而已。

   git和远端进行交互，有两种方式可选：ssh和https。不过一般https都只有下
   载权限（就像很多开源软件一样，大家都可以下载）。而上传权限的话，一般
   需要配置 =ssh= 方式了。使用ssh最好上传公钥到github上去，这样push就可
   以不需要密码了， 可以参考 [[#git-example][一个实际的例子]] 。

** git remote add & git fetch
   *我的理解*
   --------------------------------------------------------------------------------
   读了pro git对应部份，终于明白了。git remote就是控制远程的分支的。一般默
   认origin/master是你最近一次和remote连接的时候，remote那边的master指向的
   snapshot。在本地，origin/master就是指向remote的master的“指针”。
   master是指向本地的。如果在最近有别人修改过remote上的master（也就是把
   master向前推进了），使用git fetch origin来获得所有remote上origin有的而
   本地没有的。

   英文原文：To synchronize your work, you run a git fetch origin
   command. This command looks up which server origin is, fetches any
   data from it that you don't yet have, and updates your local database,
   moving your origin/master pointer to its new, more up-to-date
   position.

   那么还有一个问题：如果origin还有其他分支呢？也会一起fetch过来然后
   update了？是的。英文原文如下：

   It's important to note that when you do a fetch that brings down new
   remote branches, you don't automatically have local, ediable copies of
   them. In other words, in this case, you don't have a new serverfix
   branch -- you only have an origin/serverfix pointer that you can't modify.

   If you want your own serverfix branch that you can work on, you can
   base it off your remote branch:
   #+BEGIN_EXAMPLE
     git checkout -b origin/serverfix
   #+END_EXAMPLE
* git diff
  |-------------------+---------------------------------------------------------------------------|
  | command           | for                                                                       |
  |-------------------+---------------------------------------------------------------------------|
  | git diff          | To see what you’ve changed but not yet staged                            |
  | git diff --staged | If you want to see what you’ve staged that will go into your next commit |
  | git diff --cached | ?                                                                         |
  |-------------------+---------------------------------------------------------------------------|
* git clean
  删除没有跟踪的文件。
  |--------+----------------------------------------------------------------------------------------|
  | option | explanation                                                                            |
  |--------+----------------------------------------------------------------------------------------|
  | =-d=   | 删除untrack的文件夹和文件                                                              |
  | =-f=   | 如果 =clean.requireForce= 没有设置为false，git clean要删除文件或目录必须加上 =-f= 选项 |
  | =-x=   | 也删除忽略的文件                                                                       |
  | =-X=   | 只删除忽略的文件                                                                       |
  |--------+----------------------------------------------------------------------------------------|

* git 工具
** tig
*** 命令行下的git interface
    tig可认通过edit命令直接调出编辑器来编辑对应行的文件。我希望配置成
    emacs来编辑。默认是使用git的默认编辑器。但是 [[#git_config]] 我们配置
    editor是等待的。对于tig，我不希望等待。可以通过设置 =GIT_EDITOR= 环
    境变量来实现。把下面这句话写到 =~/.bashrc= 就可以了。
    #+BEGIN_SRC sh
      alias tig='GIT_EDITOR="emacsclient --no-wait" tig'
    #+END_SRC

    配置好tig后，直接使用 =e= 就可以调用默认编辑器来编辑对应在文件的对
    应行了。

*** status view(s)
    + =R=: refresh
    + =u=: 在unstage和stage状态中切换，对于同一文件，
      =unstage->staged= 会覆盖stage中的内容，应该是 =git add= 操作。
      =staged->unstage= ，会保留 unstage状态中的内容，应该是调用了
      =git reset HEAD <filename>=
    + =!=: 只能作用于unstaged的modified状态的文件。 =git checkout --
      <filename>= 。
    + [ ] =C=: commit。但是我这样设置了编辑器后，就没法在tig中commit了。
      还有点问题。commit还是自己用命令来搞吧。
* 一个实际的例子
  :PROPERTIES:
  :CUSTOM_ID: git-example
  :END:
  本地有一个git仓库，我想把它放到github上去。

  本机上需要先配置git的用户名和邮箱：
  #+BEGIN_SRC sh
    git config --global user.name "pengpengxp"
    git config --global user.email "pengpengxppri@gmail.com"
  #+END_SRC

  当然，为了方便，这里我还是先使用 =ssh-keygen= 生成了公钥。然后到我的
  github上把我的mka的公钥传上去了。这样以后push都不需要密码的。这样使
  用ssh的方式，用户名都是默认使用 =git= 。github区分不同的用户不是靠用
  户名，而是靠的密钥文件，详细可以参考 [[file:2017-06-21-multi-git-account-in-a-machine.org][一台电脑上多个github用户的配置]]
  。

  然后添加上远程的url：
  #+BEGIN_SRC sh
    git remote add origin git@github.com:pengpengxp/emacs.d-mac.git
  #+END_SRC

  然后使用 =git push origin master= 直接就可以传上去了。

  如果想直接就push，可以参考 [[#git-push-default][push.default]] 。

** 传是去以后还有一些文件夹没有实际上传
   原因是这些文件夹都是我通过使用`git clone'下来的。里面被理解成了
   submodule这种东西了。黙认它们应该是跟踪对应的repo去了。所以我希望
   能建立一个完全独立的.emacs.d的话。每次下载下来的东西。最好都把.git
   去掉。

** 配置ssh，不需要每次输入密码
   可以使用ssh的方式来和github仓库交互，配置默认无密码后，每次提交都不需
   要输入用户名和密码了，很方便。

   配置默认的ssh和一般几台机器上差不多，先使用ssh-keygen生成id_rsa.pub。
   然后拷贝其中内容到github端。github帐户那儿有设置ssh的。把它粘贴上去就
   行了。当然最后需要输入密码确认一遍。

   刚开始的时候我配置好了ssh，但是push还是需要输入用户名密码，结果发现，
   原来一般git clone的时候使用的是https，所有保存在origin中的url都是https
   的。需要修改为ssh的。我认为应该可以直接修改.git目录中的config中的url都
   可以的。但是我还是照着网上说的，使用命令来修改的：
   #+BEGIN_EXAMPLE
     git remote set-url origin git@github.com:pengpengxp/.emacs.d.git
   #+END_EXAMPLE

* git submodule
  一个仓库下也许某个子目录也是一个git仓库。这个目录就是一个
  =submodule= 。

  对于每个submodule都执行一下git命令：
  #+BEGIN_SRC sh
     for i in `find $PWD -type d -name "*git"`;do chdir `dirname $i`;echo $i;git status;done
     for i in `find $PWD -type d -name "*git"`;do now=`pwd`;cd `dirname $i`;echo "====>`pwd`"; git status;cd $now;done
  #+END_SRC

* MISC
