wiki/git-wiki.html

<div id="outline-container-orga6a1118" class="outline-2">
<h2 id="orga6a1118"><span class="section-number-2">14</span> git remote</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orgae7d084" class="outline-3">
<h3 id="orgae7d084"><span class="section-number-3">14.1</span> git remote base</h3>
<div class="outline-text-3" id="text-14-1">
<p>
git可以是一个本地库，但是它更多地，应该是和远端做交互，以进行多人协
作。
</p>

<p>
<code>git remote</code> 命令就是设置远端库的地址的。常用的命令：
</p>
<div class="org-src-container">
<pre class="src src-sh">     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">&#26597;&#35810;&#25152;&#26377;&#36828;&#31471;</span>
     git remote -v
     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">&#28155;&#21152;</span>
     git remote add origin &lt;url&gt;
     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">&#20462;&#25913;</span>
     git remote set-url origin &lt;url&gt;
     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">&#20854;&#23427;</span>
     git remote --help
</pre>
</div>

<p>
其实可以看到，这些 <code>origin</code> 都只是一个 <code>url</code> 的别名而已。
</p>

<p>
git和远端进行交互，有两种方式可选：ssh和https。不过一般https都只有下
载权限（就像很多开源软件一样，大家都可以下载）。而上传权限的话，一般
需要配置 <code>ssh</code> 方式了。使用ssh最好上传公钥到github上去，这样push就可
以不需要密码了， 可以参考 <a href="#git-example">一个实际的例子</a> 。
</p>
</div>
</div>

<div id="outline-container-orgdbcba7b" class="outline-3">
<h3 id="orgdbcba7b"><span class="section-number-3">14.2</span> git remote add &amp; git fetch</h3>
<div class="outline-text-3" id="text-14-2">
<p>
<b>我的理解</b>
</p>
<hr />
<p>
读了pro git对应部份，终于明白了。git remote就是控制远程的分支的。一般默
认origin/master是你最近一次和remote连接的时候，remote那边的master指向的
snapshot。在本地，origin/master就是指向remote的master的“指针”。
master是指向本地的。如果在最近有别人修改过remote上的master（也就是把
master向前推进了），使用git fetch origin来获得所有remote上origin有的而
本地没有的。
</p>

<p>
英文原文：To synchronize your work, you run a git fetch origin
command. This command looks up which server origin is, fetches any
data from it that you don't yet have, and updates your local database,
moving your origin/master pointer to its new, more up-to-date
position.
</p>

<p>
那么还有一个问题：如果origin还有其他分支呢？也会一起fetch过来然后
update了？是的。英文原文如下：
</p>

<p>
It's important to note that when you do a fetch that brings down new
remote branches, you don't automatically have local, ediable copies of
them. In other words, in this case, you don't have a new serverfix
branch &#x2013; you only have an origin/serverfix pointer that you can't modify.
</p>

<p>
If you want your own serverfix branch that you can work on, you can
base it off your remote branch:
</p>
<pre class="example">
     git checkout -b origin/serverfix
</pre>
</div>
</div>
</div>
<div id="outline-container-org74c2adc" class="outline-2">
<h2 id="org74c2adc"><span class="section-number-2">15</span> git diff</h2>
<div class="outline-text-2" id="text-15">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">command</th>
<th scope="col" class="org-left">for</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">git diff</td>
<td class="org-left">To see what you’ve changed but not yet staged</td>
</tr>

<tr>
<td class="org-left">git diff &#x2013;staged</td>
<td class="org-left">If you want to see what you’ve staged that will go into your next commit</td>
</tr>

<tr>
<td class="org-left">git diff &#x2013;cached</td>
<td class="org-left">?</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org9f73b08" class="outline-2">
<h2 id="org9f73b08"><span class="section-number-2">16</span> git clean</h2>
<div class="outline-text-2" id="text-16">
<p>
删除没有跟踪的文件。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">option</th>
<th scope="col" class="org-left">explanation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>-d</code></td>
<td class="org-left">删除untrack的文件夹和文件</td>
</tr>

<tr>
<td class="org-left"><code>-f</code></td>
<td class="org-left">如果 <code>clean.requireForce</code> 没有设置为false，git clean要删除文件或目录必须加上 <code>-f</code> 选项</td>
</tr>

<tr>
<td class="org-left"><code>-x</code></td>
<td class="org-left">也删除忽略的文件</td>
</tr>

<tr>
<td class="org-left"><code>-X</code></td>
<td class="org-left">只删除忽略的文件</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org02752f9" class="outline-2">
<h2 id="org02752f9"><span class="section-number-2">17</span> git 工具</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-orgd68fcf3" class="outline-3">
<h3 id="orgd68fcf3"><span class="section-number-3">17.1</span> tig</h3>
<div class="outline-text-3" id="text-17-1">
</div>
<div id="outline-container-org9804004" class="outline-4">
<h4 id="org9804004"><span class="section-number-4">17.1.1</span> 命令行下的git interface</h4>
<div class="outline-text-4" id="text-17-1-1">
<p>
tig可认通过edit命令直接调出编辑器来编辑对应行的文件。我希望配置成
emacs来编辑。默认是使用git的默认编辑器。但是 <a href="#git_config">7</a> 我们配置
editor是等待的。对于tig，我不希望等待。可以通过设置 <code>GIT_EDITOR</code> 环
境变量来实现。把下面这句话写到 <code>~/.bashrc</code> 就可以了。
</p>
<div class="org-src-container">
<pre class="src src-sh">      <span style="color: #b0c4de;">alias</span> <span style="color: #8fbc8f;">tig</span>=<span style="color: #ffa500;">'GIT_EDITOR="emacsclient --no-wait" tig'</span>
</pre>
</div>

<p>
配置好tig后，直接使用 <code>e</code> 就可以调用默认编辑器来编辑对应在文件的对
应行了。
</p>
</div>
</div>

<div id="outline-container-orgd622a55" class="outline-4">
<h4 id="orgd622a55"><span class="section-number-4">17.1.2</span> status view(s)</h4>
<div class="outline-text-4" id="text-17-1-2">
<ul class="org-ul">
<li><code>R</code>: refresh</li>
<li><code>u</code>: 在unstage和stage状态中切换，对于同一文件，
<code>unstage-&gt;staged</code> 会覆盖stage中的内容，应该是 <code>git add</code> 操作。
<code>staged-&gt;unstage</code> ，会保留 unstage状态中的内容，应该是调用了
<code>git reset HEAD &lt;filename&gt;</code></li>
<li><code>!</code>: 只能作用于unstaged的modified状态的文件。 <code>git checkout --
      &lt;filename&gt;</code> 。</li>
<li class="off"><code>[&#xa0;]</code> <code>C</code>: commit。但是我这样设置了编辑器后，就没法在tig中commit了。
还有点问题。commit还是自己用命令来搞吧。</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org61fc126" class="outline-2">
<h2 id="git-example"><a id="org61fc126"></a><span class="section-number-2">18</span> 一个实际的例子</h2>
<div class="outline-text-2" id="text-git-example">
<p>
本地有一个git仓库，我想把它放到github上去。
</p>

<p>
本机上需要先配置git的用户名和邮箱：
</p>
<div class="org-src-container">
<pre class="src src-sh">    git config --global user.name <span style="color: #ffa500;">"pengpengxp"</span>
    git config --global user.email <span style="color: #ffa500;">"pengpengxppri@gmail.com"</span>
</pre>
</div>

<p>
当然，为了方便，这里我还是先使用 <code>ssh-keygen</code> 生成了公钥。然后到我的
github上把我的mka的公钥传上去了。这样以后push都不需要密码的。这样使
用ssh的方式，用户名都是默认使用 <code>git</code> 。github区分不同的用户不是靠用
户名，而是靠的密钥文件，详细可以参考 <a href="2017-06-21-multi-git-account-in-a-machine.html">一台电脑上多个github用户的配置</a>
。
</p>

<p>
然后添加上远程的url：
</p>
<div class="org-src-container">
<pre class="src src-sh">    git remote add origin git@github.com:pengpengxp/emacs.d-mac.git
</pre>
</div>

<p>
然后使用 <code>git push origin master</code> 直接就可以传上去了。
</p>

<p>
如果想直接就push，可以参考 <a href="#git-push-default">push.default</a> 。
</p>
</div>

<div id="outline-container-org1dbeeab" class="outline-3">
<h3 id="org1dbeeab"><span class="section-number-3">18.1</span> 传是去以后还有一些文件夹没有实际上传</h3>
<div class="outline-text-3" id="text-18-1">
<p>
原因是这些文件夹都是我通过使用`git clone'下来的。里面被理解成了
submodule这种东西了。黙认它们应该是跟踪对应的repo去了。所以我希望
能建立一个完全独立的.emacs.d的话。每次下载下来的东西。最好都把.git
去掉。
</p>
</div>
</div>

<div id="outline-container-org91d8681" class="outline-3">
<h3 id="org91d8681"><span class="section-number-3">18.2</span> 配置ssh，不需要每次输入密码</h3>
<div class="outline-text-3" id="text-18-2">
<p>
可以使用ssh的方式来和github仓库交互，配置默认无密码后，每次提交都不需
要输入用户名和密码了，很方便。
</p>

<p>
配置默认的ssh和一般几台机器上差不多，先使用ssh-keygen生成id<sub>rsa.pub</sub>。
然后拷贝其中内容到github端。github帐户那儿有设置ssh的。把它粘贴上去就
行了。当然最后需要输入密码确认一遍。
</p>

<p>
刚开始的时候我配置好了ssh，但是push还是需要输入用户名密码，结果发现，
原来一般git clone的时候使用的是https，所有保存在origin中的url都是https
的。需要修改为ssh的。我认为应该可以直接修改.git目录中的config中的url都
可以的。但是我还是照着网上说的，使用命令来修改的：
</p>
<pre class="example">
     git remote set-url origin git@github.com:pengpengxp/.emacs.d.git
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb693221" class="outline-2">
<h2 id="orgb693221"><span class="section-number-2">19</span> git submodule</h2>
<div class="outline-text-2" id="text-19">
<p>
一个仓库下也许某个子目录也是一个git仓库。这个目录就是一个
<code>submodule</code> 。
</p>

<p>
对于每个submodule都执行一下git命令：
</p>
<div class="org-src-container">
<pre class="src src-sh">     <span style="color: PaleYellow;">for</span> i<span style="color: PaleYellow;"> in</span> <span style="color: #fa8072;">`find $PWD -type d -name "*git"`</span>;<span style="color: PaleYellow;">do</span> chdir <span style="color: #fa8072;">`dirname $i`</span>;<span style="color: #b0c4de;">echo</span> $<span style="color: #8fbc8f;">i</span>;git status;<span style="color: PaleYellow;">done</span>
     <span style="color: PaleYellow;">for</span> i<span style="color: PaleYellow;"> in</span> <span style="color: #fa8072;">`find $PWD -type d -name "*git"`</span>;<span style="color: PaleYellow;">do</span> <span style="color: #8fbc8f;">now</span>=<span style="color: #fa8072;">`pwd`</span>;<span style="color: #b0c4de;">cd</span> <span style="color: #fa8072;">`dirname $i`</span>;<span style="color: #b0c4de;">echo</span> <span style="color: #ffa500;">"====&gt;`pwd`"</span>; git status;<span style="color: #b0c4de;">cd</span> $<span style="color: #8fbc8f;">now</span>;<span style="color: PaleYellow;">done</span>
</pre>
</div>
</div>
</div>
