wiki/git-wiki.org
** 找一个库中someone修改过的文件
   #+BEGIN_SRC sh
     git log --pretty="%H" --author="authorname" |
         while read commit_hash
         do
             git show --oneline --name-only $commit_hash | tail -n+2
         done | sort | uniq
   #+END_SRC
** Doc
   [[https://git-scm.com/book/zh/v1/][中文的doc]]
** git clone只能克隆master分支，需要所有分支的时候不知道怎么办？
   其实是都在的，只不过是被隐藏了。使用下面的命令可以看到的。
   #+BEGIN_EXAMPLE
     git branch -a
   #+END_EXAMPLE
   不过如果要在remote上的其他分支上进行开发，最好在弄出一个本地分支出来做：
   #+BEGIN_EXAMPLE
     git checkout -b "local-branch-name" "remote-branch-name"
   #+END_EXAMPLE
** 远程怎么删除分支
   使用下面的命令删除远程分支：
   #+BEGIN_EXAMPLE
     git push origin --delete "remote-branch-name"
   #+END_EXAMPLE
   也可以这样简写：
   #+BEGIN_EXAMPLE
     git push origin :"remote-branch-name"
   #+END_EXAMPLE
** 在emacs使用magit与远程进行交互
   在magit的状态下，使用P，有--force选项，直接按-f，然后再按一次P就行了。

* TODO 自已配置一个git server自已使用
* COMMENT 在github上上传我的第一个repository   :needtobeimproved:gitconfig:git:
  首先配置本机上的用户名和邮箱主样才能使用git。
  #+BEGIN_SRC sh
  git config --global user.name "pengpengxp"
  git config --global user.email "pengpengxppri@gmail.com"
  #+END_SRC

  基本能使用了
** 新建repository
   首先新建一个repository，取名为.emacs.d。然后使用：
   #+BEGIN_EXAMPLE
     git clone https://github.com/pengpengxp/.emacs.d.git
   #+END_EXAMPLE

   拷贝到自己的机器上。进行自己的修改。使用：
   #+BEGIN_EXAMPLE
     git push origin master --force
   #+END_EXAMPLE
   可以将自己local的master分支push到remote的master上去。

   使用：
   #+BEGIN_EXAMPLE
     git push origin --all
   #+END_EXAMPLE
   可以将local所有的分支传上去。

   *Question*
   --------------------------------------------------------------------------------
   1) 怎么把本地的master分支push到remote的test分支上去？

   2) 这里我必须使用--force选项，好像标准流程是先使用pull从remote端拷贝过
      来进行merge，然后在使用push才行。这里我还不知道怎么处理，每次都是暴
      力使用--force选项进行的。
   --------------------------------------------------------------------------------
   *PS：现在的理解：pull是把远程的内容和我本地的内容merge。然后就可以push了。*

   上传到远程的repository上去。这里的origin我的理解其实是一个url的别名。可
   以在.git目录的config中看到并进行修改。还可以使用命令修改：
   #+BEGIN_EXAMPLE
     git remote set-url origin ssh://git@github.com:pengpengxp/.emacs.d.git
   #+END_EXAMPLE
   可以使用命令查看remote：
   #+BEGIN_EXAMPLE
     git remote -v
   #+END_EXAMPLE
   也可以添加一个：
   #+BEGIN_EXAMPLE
     git remote add upstream https://github.com/pengpengxp/.emacs.c.git
   #+END_EXAMPLE

   --------------------------------------------------------------------------------
   *Question*

   这个remote好像可以使得所有工作不相互影响。但是现在不会用，就只使用
   origin了。
   --------------------------------------------------------------------------------
* 定义自己本地的 =.gitignore=
  我使用 =gtags, cscope= 等文件，会生成一些tags和cscope开头的索引文件。
  又不想对每一个库都修改它的 =.gitignore= 。可以设置一下本地的 =git= ：
  #+BEGIN_SRC sh
git config --global core.excludesfile "~/.gitignore"
  #+END_SRC
  然后把我需要怱略的文件都写到里面：
  #+BEGIN_EXAMPLE
# tags and cscope files
TAGS
tags
GTAGS
GSYMS
GRTAGS
GPATH
cscope.*
  #+END_EXAMPLE

  这下每个库中git都不会管这些文件了。
* magit
  =magit-log-buffer-file= 可以显示出来一个文件对应修改的commit。选中区
  域后还可以只显示出修改这个区域的commit。这个命令对于查看一个文件的修
  改历史很有用。
* 使用gitlab直接在command line中gitlab发merge request

  #+BEGIN_SRC sh :tangle /tmp/create_merge_request.sh
#!/bin/bash

# 需要先安装一个ruby的包
# gem install gitlab

# 设置一下gitlab的restfull api地址
export GITLAB_API_ENDPOINT=http://10.0.0.3:9000/api/v4

# 这个token需要到自己的gitlab账户里面去生成一个，直接copy下来
export GITLAB_API_PRIVATE_TOKEN=<your token>

# 最后的assignee_id就是指定的assignee的用户，可以使用gitlab users查对应的id
gitlab create_merge_request zhangjm/test "New merge request" "{source_branch: 'pull_request_cmd', target_branch: 'master', assignee_id: 2}"

exit 0

  #+END_SRC
* git显示一个文件的所有历史修改记录
  #+BEGIN_SRC sh
git log --follow -p -- <file>
  #+END_SRC
