wiki/git-wiki.html

<div id="outline-container-org6cbed87" class="outline-2">
<h2 id="org6cbed87"><span class="section-number-2">20</span> MISC</h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-org8cef51f" class="outline-3">
<h3 id="org8cef51f"><span class="section-number-3">20.1</span> 找一个库中someone修改过的文件</h3>
<div class="outline-text-3" id="text-20-1">
<div class="org-src-container">
<pre class="src src-sh">     git log --pretty=<span style="color: #ffa500;">"%H"</span> --author=<span style="color: #ffa500;">"authorname"</span> |
         <span style="color: PaleYellow;">while </span><span style="color: #b0c4de;">read</span> commit_hash
         <span style="color: PaleYellow;">do</span>
             git show --oneline --name-only $<span style="color: #8fbc8f;">commit_hash</span> | tail -n+2
         <span style="color: PaleYellow;">done</span> | sort | uniq
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd76c2d3" class="outline-3">
<h3 id="orgd76c2d3"><span class="section-number-3">20.2</span> Doc</h3>
<div class="outline-text-3" id="text-20-2">
<p>
<a href="https://git-scm.com/book/zh/v1/">中文的doc</a>
</p>
</div>
</div>
<div id="outline-container-org4e59e51" class="outline-3">
<h3 id="org4e59e51"><span class="section-number-3">20.3</span> git clone只能克隆master分支，需要所有分支的时候不知道怎么办？</h3>
<div class="outline-text-3" id="text-20-3">
<p>
其实是都在的，只不过是被隐藏了。使用下面的命令可以看到的。
</p>
<pre class="example">
     git branch -a
</pre>
<p>
不过如果要在remote上的其他分支上进行开发，最好在弄出一个本地分支出来做：
</p>
<pre class="example">
     git checkout -b "local-branch-name" "remote-branch-name"
</pre>
</div>
</div>
<div id="outline-container-orgaca066c" class="outline-3">
<h3 id="orgaca066c"><span class="section-number-3">20.4</span> 远程怎么删除分支</h3>
<div class="outline-text-3" id="text-20-4">
<p>
使用下面的命令删除远程分支：
</p>
<pre class="example">
     git push origin --delete "remote-branch-name"
</pre>
<p>
也可以这样简写：
</p>
<pre class="example">
     git push origin :"remote-branch-name"
</pre>
</div>
</div>
<div id="outline-container-org6768b5d" class="outline-3">
<h3 id="org6768b5d"><span class="section-number-3">20.5</span> 在emacs使用magit与远程进行交互</h3>
<div class="outline-text-3" id="text-20-5">
<p>
在magit的状态下，使用P，有&#x2013;force选项，直接按-f，然后再按一次P就行了。
</p>
</div>
</div>
</div>

<div id="outline-container-orgef56a7e" class="outline-2">
<h2 id="orgef56a7e"><span class="section-number-2">21</span> <span class="todo TODO">TODO</span> 自已配置一个git server自已使用</h2>
</div>
<div id="outline-container-orgaae5824" class="outline-2">
<h2 id="orgaae5824"><span class="section-number-2">22</span> 定义自己本地的 <code>.gitignore</code></h2>
<div class="outline-text-2" id="text-22">
<p>
我使用 <code>gtags, cscope</code> 等文件，会生成一些tags和cscope开头的索引文件。
又不想对每一个库都修改它的 <code>.gitignore</code> 。可以设置一下本地的 <code>git</code> ：
</p>
<div class="org-src-container">
<pre class="src src-sh">git config --global core.excludesfile <span style="color: #ffa500;">"~/.gitignore"</span>
</pre>
</div>
<p>
然后把我需要怱略的文件都写到里面：
</p>
<pre class="example">
# tags and cscope files
TAGS
tags
GTAGS
GSYMS
GRTAGS
GPATH
cscope.*
</pre>

<p>
这下每个库中git都不会管这些文件了。
</p>
</div>
</div>
<div id="outline-container-orgfb688ba" class="outline-2">
<h2 id="orgfb688ba"><span class="section-number-2">23</span> magit</h2>
<div class="outline-text-2" id="text-23">
<p>
<code>magit-log-buffer-file</code> 可以显示出来一个文件对应修改的commit。选中区
域后还可以只显示出修改这个区域的commit。这个命令对于查看一个文件的修
改历史很有用。
</p>
</div>
</div>
<div id="outline-container-orgebbeffb" class="outline-2">
<h2 id="orgebbeffb"><span class="section-number-2">24</span> 使用gitlab直接在command line中gitlab发merge request</h2>
<div class="outline-text-2" id="text-24">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #cd5c5c;">#</span><span style="color: #cd5c5c;">!/bin/</span><span style="color: PaleYellow;">bash</span>

<span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">&#38656;&#35201;&#20808;&#23433;&#35013;&#19968;&#20010;ruby&#30340;&#21253;</span>
<span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">gem install gitlab</span>

<span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">&#35774;&#32622;&#19968;&#19979;gitlab&#30340;restfull api&#22320;&#22336;</span>
<span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">GITLAB_API_ENDPOINT</span>=http://10.0.0.3:9000/api/v4

<span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">&#36825;&#20010;token&#38656;&#35201;&#21040;&#33258;&#24049;&#30340;gitlab&#36134;&#25143;&#37324;&#38754;&#21435;&#29983;&#25104;&#19968;&#20010;&#65292;&#30452;&#25509;copy&#19979;&#26469;</span>
<span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">GITLAB_API_PRIVATE_TOKEN</span>=&lt;your token&gt;

<span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">&#26368;&#21518;&#30340;assignee_id&#23601;&#26159;&#25351;&#23450;&#30340;assignee&#30340;&#29992;&#25143;&#65292;&#21487;&#20197;&#20351;&#29992;gitlab users&#26597;&#23545;&#24212;&#30340;id</span>
gitlab create_merge_request zhangjm/test <span style="color: #ffa500;">"New merge request"</span> <span style="color: #ffa500;">"{source_branch: 'pull_request_cmd', target_branch: 'master', assignee_id: 2}"</span>

<span style="color: PaleYellow;">exit</span> 0

</pre>
</div>
</div>
</div>
<div id="outline-container-orgdeb1bcb" class="outline-2">
<h2 id="orgdeb1bcb"><span class="section-number-2">25</span> git显示一个文件的所有历史修改记录</h2>
<div class="outline-text-2" id="text-25">
<div class="org-src-container">
<pre class="src src-sh">git log --follow -p -- &lt;file&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pengpengxp</p>
<p class="date">Created: 2019-03-25 一 17:49</p>
<p class="validation"></p>
</div>
</body>
</html>
